Repository: RainbowInHell/BmpViewer
Catalog: КурсоваяBMPFinal/MyString.*.resx
Languages: be_by

# BadFile
source: Oops, there seems to be something wrong with the file! Restart the application and try again!
be_by: Упс, здаецца з файлам нешта не так! Перезагрузите прыкладанне і паспрабуйце яшчэ раз!

# Er
source: Error!
be_by: Памылка!

# Expansion
source: Expanding your image is not bmp!
be_by: Пашырэнне вашага малюнка не bmp!

# Format
source: Your image format is not Format24bppRgb!
be_by: Фармат вашага изображния ня Format24bppRgb!

# FreeFile
source: File is empty!
be_by: Пусты файл!

# FreeRich
source: RichBox is empty!
be_by: Пусты RichBox!

# FromTo
source: Fields From and To are required!
be_by: Поля Ад і Да абавязковыя да запаўнення!

# GG
source: Critical error!
be_by: Крытычная памылка!

# Info
source: Information about the program!
be_by: Інфармацыя аб праграме!

# Info1
source: This program is designed to process BMP images with 24-bit color depth.
be_by: Дадзеная праграма створана для апрацоўкі BMP-малюнкаў з 24-хбитной глыбінёй колеру

# Invalid
source: Invalid input
be_by: некарэктны ўвод

# Lang
source: Restart the application to install the language.
be_by: Для ўстаноўкі мовы перазагрузіце дадатак.

# LoginFree
source: The login string cannot be empty!
be_by: Радок для лагіна не можа быць пусты!

# NoDirty
source: You have not spoiled the photo yet in order to correct it!
be_by: Вы яшчэ не псавалі фота, для таго, каб яго выпраўляць!

source: No memory!
be_by: Няма памяцi!

# PassFree
source: Password string cannot be empty!
be_by: Радок для пароля не можа быць пусты!

# PassLenght
source: The length of the password cannot be less than 5 or more than 13 characters
be_by: Доўгая пароля не можа быць менш 5 або больш 13 сімвалаў

# Path
source: Path for the processed file
be_by: Шлях для апрацаванага файла

# PhotoChoose
source: Choose a photo!
be_by: Выберыце фота!

# Reg
source: You are registered!
be_by: Вы зарэгістраваныя!

# SamePerson
source: This user already exists!
be_by: Такі карыстач ужо ёсць!

# Smth
source: Check the correctness of the login and password!
be_by: Праверце правільнасць ўводу лагіна і пароля!

# Spravka
source: 1. Exit the program. 2. Information about the program.3. Help for using the program.4. Use this button to apply the Negative filter to any image you choose in PictureBox.5. If you have previously damaged the image with black pixels, then this button will allow you to correct the image and select it at the path you specified to view the results.6. Thanks to this button, you can ruin your image with black pixels.7. Required input field.The value From-sets the first number to randomize the spread of dirty pixels.8. Required input field.The value To-sets the second number for randomizing the spread of dirty pixels.9. Thanks to this button, you can ruin your image with white pixels.10. If you have previously damaged the image with white pixels, then this button will allow you to correct the image and select it at the path you specified to view the results.11. Use this button to apply a Sepia filter to any image you choose in PictureBox. 12. The button for a full restart of the application(When you click it when you restart the program, you will be in the atorization window).13. Allows you to select any available image from the one on your computer via the file explorer.14. Closes the image that is in the left window.15. Allows you to select the processed image along the path that will be reported to you after any processing.16. View all images in the selected folder in the left direction.17. View all images in the selected folder in the right direction.18. Closes the image that is located in the right window.
be_by: 1. Выхад з праграмы. 2. Інфармацыя аб праграме.3. Даведка для карыстання праграмай.4. З дапамогай гэтай кнопкі вы зможаце прымяніць фільтр негатыў на любы абранае вамі малюнак у pictureBox.5. Калі раней вы псавалі малюнак чорнымі пікселямі, то дзякуючы гэтай кнопкі вы зможаце выправіць малюнак і выбраць яго па паказаным вам шляху, каб праглядзець резульат.6. Дзякуючы гэтай кнопцы вы можаце сапсаваць ваша малюнак з дапамогай чорных пікселяў.7. Абавязковае поле для ўводу.Значэнне ад-задае першае чысло для рандомизации распаўсюджвання брудных пікселяў.8. Абавязковае поле для ўводу.Значэнне да-задае другое лік для рандомизации распаўсюджвання брудных пікселяў.9. Дзякуючы гэтай кнопцы вы можаце сапсаваць ваша малюнак з дапамогай белых пікселяў.10. Калі раней вы псавалі малюнак белымі пікселямі, то дзякуючы гэтай кнопкі вы зможаце выправіць малюнак і выбраць яго па паказаным вам шляху, каб праглядзець рэзульат.11. З дапамогай гэтай кнопкі вы зможаце прымяніць фільтр сэпія на любы абранае вамі малюнак у pictureBox.12. Кнопка для поўнай перазагрузкі прыкладання(пры яе націску пры паўторным запуску праграмы вы будзеце знаходзіцца ў акне аторизации).13. Дазваляе вам выбраць любы даступнае малюнак праз якое знаходзіцца на вашым компьетере праз правадыр.14. Закрывае малюнак якое знаходзіцца ў левым акне.15. Дазваляе вам выбраць апрацаванае малюнак па шляху, які будзе вам паведамлены пасля якой - небудзь апрацоўкі.16. Прагляд ўсіх малюнкаў у абраным каталогу у напрамку налева.17. Прагляд ўсіх малюнкаў у абраным каталогу у напрамку направа.18. Закрывае малюнак якое знаходзіцца ў правым акне.

source: Welcome,
be_by: Сардэчна запрашаем,
